{
    "EventStages":{
        "main":{
            "TexturePath": {
                "Value": "events/doctor/nurse_bj_1.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"You slowly regain consciousness. Apperently you are lying in a bed. There is a very nice feeling. It takes you a few seconds to realize that it comes from your dick.",
                    "1":"You still feel dizzy and opening your eyes is harder than expected. And as you open them they take some time to adapt to the bright light.",
                    "2":"Finally you manage to turn your head and see what is going on down below.",
                    "3":"A very attractive young nurse is licking the tip of your penis, obviously enjoying herself."
                }
            },
            "Options":{
                "0":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.bj2"
                        }
                    }
                }
            }
        },
        "bj2":{
            "TexturePath": {
                "Value": "events/doctor/nurse_bj_2.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"She realizes that she must have woken you up, because she looks up to you, make eye contact and smiles as she continues licking you.",
                    "1":"After a while she takes the full length of your member into your mouth and starts giving you a blowjob. It feels amazing. She obiously had some training."
                }
            },
            "Options":{
                "0":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.more"
                        }
                    }
                }
            }
        },
        "more":{
            "TexturePath": {
                "Value": "events/doctor/nurse_chast1.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"<speaker>Are you ready for more?</speaker> Her voice is very soft an sensual.",
                    "1":"You feel your strength reurning to your muscles and produce a nod.",
                    "2":"She smiles and raises up her skirt. Then she pulls down her panties.",
                    "3":"You see some kind of plastic and metal contraption. It takes you several moments to realize that there is a penis trapped inside of it, locked away with a padlock. This beautiful young woman is a man!",
                    "4":"<speaker>Do you like what you see?</speaker>"
                }
            },
            "Options":{
                "Continue":{
                    "Text": "Yes",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.f1"
                        }
                    }
                },
                "Abort":{
                    "Text": "No",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.abort"
                        }
                    }
                }
            }
        },
        "abort":{
            "TexturePath": {
                "Value": "events/doctor/nurse_bj_1.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"Speaking feels hard, so you just shake your head no.",
                    "1":"<speaker>That's a shame. We could have so much fun together.</speaker>",
                    "2":"She goes down on you again. You want to protest, but she has already injected another syringe into your upper leg.",
                    "3":"The world goes black again. The last thing you see is your cock being licked by this weird nurse."
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.operation"
                        }
                    }
                }
            }
        },
        "f1":{
            "TexturePath": {
                "Value": "events/doctor/nurse_fuck_1.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"Speaking feels hard, so you just nod your head yes.",
                    "1":"She just smiles and climbs on your penis. She must have lubed herself up already, because you find it easy to enter into her backdoor.",
                    "2":"For a few minutes she rides you in cowgirl position.",
                    "3":"You feel your strength returning. Maybe you could change the position?"
                }
            },
            "Options":{
                "Continue":{
                    "Text": "Doggy Style",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.f2"
                        }
                    }
                },
                "Abort":{
                    "Text": "Cowgirl",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.f1end"
                        }
                    }
                }
            }
        },
        "f1end":{
            "TexturePath": {
                "Value": "events/doctor/nurse_fuck_5.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"She continues riding you without getting any slower.",
                    "1":"You feel a mighty orgasm building up. She seems to know that you are close to cumming. <speaker>Oh yes. Please cum inside of me!</speaker>",
                    "2":"You feel yourself erupting inside of her. This is amazing! She smiles as she continues riding until your are completely done."
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.fend"
                        }
                    }
                }
            }
        },
        "f2":{
            "TexturePath": {
                "Value": "events/doctor/nurse_fuck_3.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"You push her to the side of the bed and onto her knees and palms.",
                    "1":"Then you grab her by her hip with one hand while exploring her back with the other hand.",
                    "2":"Her chastity cage is the only thing weird you find. You give it a small tug which results in a moan from the nurse. The cage doesn't move a tiny bit.",
                    "3":"It seems to be impossible to remove the cage without the proper key. And the key is nowhere in sight. Maybe she doen't even have access to it?"
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.f3"
                        }
                    }
                }
            }
        },
        "f3":{
            "TexturePath": {
                "Value": "events/doctor/nurse_fuck_2.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"You direct your cock to her ass and slowly push it inside. It just feels like taking a real girl from behind. And from this position you could even convince yourself that she was one.",
                    "1":"You push yourself inside of her faster and harder, motivated by her louder getting moans."
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.f4"
                        }
                    }
                }
            }
        },
        "f4":{
            "TexturePath": {
                "Value": "events/doctor/nurse_fuck_4.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "2":"You feel a mighty orgasm building up. She seems to know that you are close to cumming. <speaker>Oh yes. Please cum inside of me!</speaker>",
                    "3":"You feel yourself erupting inside of her. This is amazing!",
                    "4":"After you are done you roll to the side, taking a breath. She wastes no time and climbs back on top of you."
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.fend"
                        }
                    }
                }
            }
        },
        "fend":{
            "TexturePath": {
                "Value": "events/doctor/nurse_breasts_1.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"<speaker>That was amazing.</speaker> She smiles as she directs your hands to her boobs so you can grab them. They feel so natural!",
                    "1":"<speaker>And I am so sorry for this.</speaker> You feel a short pain. Apparently she has injected a syringe into your upper leg.",
                    "2":"Once again the world around you goes dark."
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.operation"
                        }
                    }
                }
            }
        },
        "operation":{
            "TexturePath": {
                "Value": "events/doctor/operation.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"You lose all sense of time while you are blacked out. Did minutes pass? Or maybe months? You can't tell.",
                    "1":"There are images of surgical operations in your mind. Are they real? Or bad dreams?",
                    "2":"When you finally gain consciousness again you feel very weird, as if you were a stranger to your own body."
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.wakeUp"
                        }
                    }
                }
            }
        },
        "wakeUp":{
            "TexturePath": {
                "Value": "events/doctor/lights.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"Apparently you are lying on a bed, your arms and legs spread. There is also and unfamiliar weight on your chest.",
                    "1":"You try to raise up, but something holds you back. Apparently there run several leather straps over your chest, arms and legs, fixating you to the bed.",
                    "2":"You open your eyes. Something clearly isn't right. But all you can see are some surgical lights at the ceiling.",
                    "3":"Just as you were above to call out for help you realize that your mouth is filled with something. Is it rubber?",
                    "4":"You feel panic building up inside of you. What is this?! Then you hear steps approaching."
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.introduction"
                        }
                    }
                }
            }
        },
        "introduction":{
            "TexturePath": {
                "Value": "events/doctor/bound.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"A hand reaches behind your head and pulls it up. Weird, it feels as if you have way longer hair than you remember.",
                    "1":"You see that a doctor is pulling your head so you face him.",
                    "2":"<speaker>There there, Princess. Finally awake, are we?</speaker> His voice sounds cruel and does nothing to give you any comfort.",
                    "3":"<speaker>Feel this?</speaker> He touches your chest. But something is wrong. It feels as if you have breasts there!",
                    "4":"He seems to have guessed your thoughts. <speaker>Yes, that's right. We have given you some nice soft breasts. And that's a small change compared to all the other changes we did to your body.</speaker>",
                    "5":"<speaker>You will spend your future as a girl. I think that's a quite fitting punishment for rapist scum like you.</speaker>",
                    "6":"<speaker>Now I will give you some time to get accustomed to this change. Another doctor will look after you in a few hours.</speaker>"
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.breastPOV"
                        }
                    }
                }
            }
        },
        "breastPOV":{
            "TexturePath": {
                "Value": "events/doctor/breast_pov.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"You hear him leaving. This can't be happening. When you agreed to the punishment you would have never imagined that it would be so severe.",
                    "1":"You try to push yourself up again. This time you manage to get a glimpse of your lower body. You don't see only a little more than your new breast.",
                    "2":"They are really there! What kind of madness is this?!",
                    "3":"The worst thing is that you can't feel your genitals. But surely they are still there?!"
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.doctorExplanation"
                        }
                    }
                }
            }
        },
        "doctorExplanation":{
            "TexturePath": {
                "Value": "events/doctor/syringe.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"It takes an eternity until you hear steps approaching again. It is the doctor from the courthouse again.",
                    "1":"<speaker>Hello. I hope you don't mind the straps. They are only there to prevent you from hurting yourself while you get used to your new situation.</speaker>",
                    "2":"<speaker>This must be all very confusing to you. But don't worry, everything will be explained to you in time.</speaker>",
                    "3":"<speaker>For now I have to make sure that you are healthy. I will untie you now if you confirm that you are calm enough.</speaker>"
                }
            },
            "Options":{
                "Continue":{
                    "Text": "Nod",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.inspectionBreasts"
                        }
                    }
                }
            }
        },
        "inspectionBreasts":{
            "TexturePath": {
                "Value": "events/doctor/inspection_breast.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"He unties you and helps you to sit up. You look down your body. It is completely hairless. Did your waist shrink? And didn't your hands and feet used to be bigger?",
                    "1":"You also try to glance down to your privates, but they are covered with a towel.",
                    "2":"As you look up you see two policemen near the door. Even if you were in the condition to resist there would be no use doing so.",
                    "3":"The doctor squeezes your left breast, then the right one.",
                    "4":"<speaker>Very good. You got the newest implants on the market. Nobody will be able to see or feel the difference between them and natural grown breasts.</speaker>"
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.inspectionMouth"
                        }
                    }
                }
            }
        },
        "inspectionMouth":{
            "TexturePath": {
                "Value": "events/doctor/inspecation_face.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"He removes the thing inside your mouth next. It was a ball gag.",
                    "1":"<speaker>Open your mouth.</speaker>",
                    "2":"<speaker=PC>No way...</speaker> You stop abruptly. That's not your voice! It's high and feminine.",
                    "3":"Too bewildered to resist you open your mouth. You feel the doctor probing your teeth and your tongue.",
                    "4":"<speaker>Very good indeed.</speaker> He makes some notes on a noteblock."
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.chastity"
                        }
                    }
                }
            }
        },
        "chastity":{
            "TexturePath": {
                "Value": "events/doctor/chastity.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "1":"<speaker>Now to a rather unpleasant surprise.</speaker>",
                    "2":"He removes the towel covering your privates. To your delight your genitals are still there.",
                    "3":"But your penis is encaged in the same kind of chastity device you saw at the nurse before!",
                    "4":"You reach down and try to touch yourself. On the upside you feel your cock again. But it is only the uncormfortable tightness of the cage.",
                    "5":"The cage seems to be completely secure. Without the key to the padlock you won't be able to remove it."
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.dress"
                        }
                    }
                }
            }
        },
        "dress":{
            "TexturePath": {
                "Value": "events/doctor/dress.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"<speaker=PC>But why...</speaker> Your new voice is still startling you.",
                    "1":"<speaker>Everything will be explained to you in time. For now you only have to know that all changes we made can and will be reverted if you follow some rules.</speaker>",
                    "2":"You just nod. That's at least some light at the horizon.",
                    "3":"<speaker>Of course we have provided you with some clothes.</speaker> He points at another bed.",
                    "4":"You inspect them. There is a shirt, jeans and a pair of flats as well as a bra and panties.",
                    "5":"You put on the panties first. It takes some squeezing to fit your chastity cage into them. But over all they don't feel too peculiar.",
                    "6":"The bra is next. Are you really supposed to put it on? But they wouldn't have provided you with one if they didn't expect you to wear it, right? And maybe your new breasts become uncomfortable without it?",
                    "7":"Since you have never put on a bra you figure that it would be easier to close it in front of your chest with the cups on your back and then drag it around your body.",
                    "8":"Finally you put on the jeans, the shirt and the shoes. Each of these items is clearly made for girls but at least they are not too girly."
                }
            },
            "Options":{
                "Continue":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor.face"
                        }
                    }
                }
            }
        },
        "face":{
            "TexturePath": {
                "Value": "events/doctor/face.png"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"Face."
                }
            },
            "Options":{
                "Mirror":{
                    "Text": "Look into the mirror",
                    "Commands": {
                        "dialog":{
                            "Type": "Dialog",
                            "DialogID": "SelectImage",
                            "Settings": {
                                "Targets": {
                                    "PATH": "PC.texturePath"
                                },
                                "Path":"media/npc/random_f"
                            }
                        }
                    }
                }
            }
        }
    }
}