{
    "EventStages":{
        "main":{
            "TexturePath": {
                "Value": "events/intro/criminal/courthouse.jpg"
            },
            "Text": {
                "JoinWith": "\n",
                "Values":{
                    "0":"You have allegedly abused your ex girlfriend.",
                    "1":"Today is your first time at the court.",
                    "2":"You are still living at home. Since you are under house arrest two policemen have brought you in front of the courthouse and are staying right behind you."
                }
            },
            "Options":{
                "0":{
                    "Text": "Enter the Courthouse",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_criminal.courthouse"
                        }
                    }
                }
            }
        },
        "courthouse":{
            "TexturePath": {
                "Value": "events/intro/criminal/attorney.jpg"
            },
            "Text":{
                "JoinWith": "\n",
                "Values":{
                    "0":"As you enter the courthouse you see your attorney. Apparently she has been waiting for you.",
                    "1":"<speaker>Hello {PC.nameFirst}. I am afraid I have bad news for you. The judge for our case is a good friend of the alleged victims father. I have no doubt that you will be found guilty if he choses the verdict.</speaker>",
                    "2":"<speaker>But don't worry. I have spoken to the district attorney. Since this was your first offense she agreed to letting you free. You just have to accept a new form of creative punishment.</speaker>"
                }
            },
            "Options":{
                "0":{
                    "Text": "What kind of punishment?",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_criminal.whatpunishment"
                        }
                    }
                }
            }
        },
        "whatpunishment":{
            "TexturePath": {
                "Value": "events/intro/criminal/attorney.jpg"
            },
            "Text":{
                "JoinWith": "\n",
                "Values":{
                    "0":"<speaker=PC>What kind of punishment are we talking about?</speaker>.",
                    "1":"<speaker>I don't know. They want to test out new methods. They are meant as a deterrence, so don't expect something enjoyable.</speaker>",
                    "2":"<speaker>But don't expect anything too harsh neither. It's usually something like community work or an humiliating public apology.</speaker>",
                    "3":"<speaker>But whatever it is, it can't be worse than 10 or more years in prison, that's for sure.</speaker>",
                    "4":"<speaker>However, the choice is yours. The district attorney will ask you whether you commited the crime. If you admit it you get the creative punishment, otherwise we will have a regular prrocess.</speaker>"
                }
            },
            "Options":{
                "0":{
                    "Text": "I will think about it",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_criminal.courtroom"
                        }
                    }
                }
            }
        },
        "courtroom":{
            "TexturePath": {
                "Value": "events/intro/criminal/courtroom.jpg"
            },
            "Text":{
                "JoinWith": "\n",
                "Values":{
                    "0": "You don't have to wait long before a policemen escorts you into the courtroom. The attorneys are already here, as well as the courts secretary. There are a few spectators, but you know none of them.",
                    "1": "You sit down at your designated place. After a few minutes the judge enters to room. Everybody stands up just to sit down again after the judge settled down.",
                    "2": "The courts secrerary read down the accusation. She then asks you whether your personal details are correct. After you confirm your name and your address the district attorney rises up.",
                    "3": "<speaker>Your honor, if I may? The bureau of investigation would like to test a special treatment with Mr. {PC.nameLast}.</speaker> She continues for some minutes explaining the legal details of her proposal. Afterwards she sits down again and the judge turns to you",
                    "4": "<speaker>Well then, Mr. {PC.nameLast}. I assume your attorney informed you about this proposal already? Do you admit commiting the crime and getting the special treatment we just heard about?</speaker>"
                }
            },
            "Options":{
                "commitTrue":{
                    "Text": "Yes, I commited the crime (truth)",
                    "Commands": {
                        "setGuilty":{"Type":"Set", "Values":{"b_bs_criminal_guilty":true}},
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_criminal.admit"
                        }
                    }
                },
                "commitLie":{
                    "Text": "Yes, I commited the crime (lie)",
                    "Commands": {
                        "setGuilty":{"Type":"Set", "Values":{"b_bs_criminal_guilty":false}},
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_criminal.admit"
                        }
                    }
                },
                "denyLie":{
                    "Text": "No, I didn't commit the crime (lie)",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_criminal.jailGuilty"
                        }
                    }
                },
                "denyTrue":{
                    "Text": "No, I didn't commit the crime (truth)",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_criminal.jailNotGuilty"
                        }
                    }
                }
            }
        },
        "jailGuilty":{
            "TexturePath": {
                "Value": "events/intro/criminal/jail.jpg"
            },
            "Text":{
                "JoinWith": "\n",
                "Values":{
                    "0": "<align=\"center\"><b><size=300%><color=\"red\">Game Over</color></size></b></align>",
                    "1": "You deny commiting the crime.",
                    "2": "Over the next three months you get what appears to be a fair and just trial. Since you are actually guilty there is some convincing evidence against you.",
                    "3": "In the end it is no surprise that you are sentenced to 15 years of prison."
                }
            }
        },
        "jailNotGuilty":{
            "TexturePath": {
                "Value": "events/intro/criminal/jail.jpg"
            },
            "Text":{
                "JoinWith": "\n",
                "Values":{
                    "0": "<align=\"center\"><b><size=300%><color=\"red\">Game Over</color></size></b></align>",
                    "1": "You deny commiting the crime.",
                    "2": "Over the next three months you get trialed. There is a lot of forged evidence against you and the judge seems to be very biased against you.",
                    "3": "In the end it is no surprise that you are sentenced to 15 years of prison."
                }
            }
        },
        "admit":{
            "TexturePath": {
                "Value": "events/contractSign.jpg"
            },
            "Text": {
                "Values":{
                    "1": "You admit commiting the crime.",
                    "2": "The district attorney hands you some papers to sign.",
                    "3": "You read the first few lines. Apparently you are expected to sign away many of your legal rights. But yet again your attorney is right: that's better than spending time in prison.",
                    "4": "You reluctantly sign the paper.",
                    "5": "<speaker>Very good.</speaker> The district attorney grins. Follow me now. You follow her, wondering where she will lead you."
                }
            },
            "Options":{
                "follow":{
                    "Text": "Follow her",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_criminal.doctor"
                        }
                    }
                }
            }

        },
        "doctor":{
            "TexturePath": {
                "Value": "events/doctor/syringe.jpg"
            },
            "Text": {
                "Values":{
                    "1": "She leads you to what appears to be the courts medical station. A doctor is already waiting for you there.",
                    "2": "<speaker>That's the case we talked about.</speaker> She points at you.",
                    "3": "<speaker>Ah, I understand.</speaker> The doctor nods. <speaker>Well then, Mr. {PC.nameLast}. Just hold still. This will only hurt a tiny bit.</speaker>",
                    "4": "He takes a syringe he had prepared and signals you to uncover your upper left arm. After hesitating for a second you do as commanded and the doctor injects the syringe into the arm.",
                    "5": "Before being able to question what just happened everything goes black."
                }
            },
            "Options":{
                "follow":{
                    "Text": "...",
                    "Commands": {
                        "enter":{
                            "Type": "Event",
                            "EventID": "intro_doctor."
                        }
                    }
                }
            }

        }
    }
}